import pandas as pd
import random

num_records = 20
first_names = ["สมชาย", "สมหญิง", "ณัฐวุฒิ", "กิตติ", "ปวีณา", "ธนวัฒน์", "วรินทร", "อรทัย", "จิราพร", "สุนทร"]
last_names = ["วงศ์แก้ว", "สังขกุล", "จันทร์แจ่ม", "ทองดี", "บุญมา", "สายทอง", "คำภีร์", "แสงทอง", "ศรีสุข", "รัตนสุข"]

degree_list = [
    "การจัดการมหาบัณฑิต",
    "การแพทย์แผนไทยประยุกต์บัณฑิต",
    "ครุศาสตรบัณฑิต",
    "ครุศาสตรมหาบัณฑิต",
    "นิติศาสตรบัณฑิต",
    "นิเทศศาสตรดุษฎีบัณฑิต",
    "นิเทศศาสตรบัณฑิต",
    "นิเทศศาสตรมหาบัณฑิต",
    "บริหารธุรกิจดุษฎีบัณฑิต",
    "บริหารธุรกิจบัณฑิต",
    "บริหารธุรกิจมหาบัณฑิต",
    "บัญชีบัณฑิต",
    "ปรัชญาดุษฎีบัณฑิต",
    "พยาบาลศาสตรบัณฑิต",
    "รัฐประศาสนศาสตรบัณฑิต",
    "รัฐประศาสนศาสตรมหาบัณฑิต",
    "รัฐศาสตรดุษฎีบัณฑิต",
    "รัฐศาสตรบัณฑิต",
    "รัฐศาสตรมหาบัณฑิต",
    "วิทยาศาสตรบัณฑิต",
    "วิทยาศาสตรมหาบัณฑิต",
    "วิศวกรรมศาสตรบัณฑิต",
    "ศิลปกรรมศาสตรบัณฑิต",
    "ศิลปบัณฑิต",
    "ศิลปศาสตรบัณฑิต",
    "ศิลปศาสตรมหาบัณฑิต",
    "สถาปัตยกรรมศาสตรบัณฑิต",
    "สาธารณสุขศาสตรบัณฑิต",
    "สารสนเทศศาสตรบัณฑิต",
    "เศรษฐศาสตรบัณฑิต"
]

def generate_nisit():
    return ''.join(str(random.randint(0, 9)) for _ in range(11))


data = []
for _ in range(num_records):
    name = f"{random.choice(first_names)} {random.choice(last_names)}"
    degree = random.choice(degree_list)
    verified1 = random.choice([0, 1, 2])
    nisit = generate_nisit()
    data.append({
        "รหัสนิสิต": nisit,
        "ชื่อ-นามสกุล": name,
        "ชื่อปริญญา": degree,
        "สถานะรายงานตัว": verified1,
    })

df = pd.DataFrame(data)
output_path = r"C:\Users\Acer\Downloads\RFID\rfid_main\simu_person.xlsx"
df.to_excel(output_path, index=False)
print("สร้างไฟล์ simu_person.xlsx สำหรับ import เรียบร้อยแล้ว")
